Tekla.Structures.Drawing.EmbeddedObjectBase
The EmbeddedObjectBase class defines an embedded object in a drawing.
The object refers to another file in the file system and its drawing
representation is updated when a drawing is opened.

Tekla.Structures.Drawing.EmbeddedObjectBase.InsertionPoint
Gets or sets the insertion point.

Tekla.Structures.Drawing.EmbeddedObjectBase.FileName
Gets or sets the file name defining the embedded object.
Remarks: A full path should be used because the application may
not be running with the same working directory as Tekla Structures
(usually using \TeklaStructuresModels\ModelName).

Tekla.Structures.Drawing.EmbeddedObjectBase.Angle
Gets or sets the angle (in degrees).

Tekla.Structures.Drawing.EmbeddedObjectBase.Size
Gets or sets the size of the frame of the embedded object.

Tekla.Structures.Drawing.EmbeddedObjectBase.Attributes
Gets or sets the attributes.

Tekla.Structures.Drawing.EmbeddedObjectBase.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.EmbeddedObjectBase.Insert
Inserts the embedded object.
Returns: True if succeeded.

Tekla.Structures.Drawing.EmbeddedObjectBase.Select
Selects the embedded object.
Returns: True if succeeded.

Tekla.Structures.Drawing.EmbeddedObjectBase.Modify
Modifies the embedded object.
Returns: True if succeeded.

Tekla.Structures.Drawing.EmbeddedObjectBase.Delete
Deletes the embedded object.
Returns: True if succeeded.

Tekla.Structures.Drawing.EmbeddedObjectBase.MoveObjectRelative(Tekla.Structures.Geometry3d.Vector)
Moves the object according to the given move vector.
moveVector: The move vector to be used.
Returns: True.
The following example calculates a move vector from two points.
The move vector in the example will move an object 1000 points in the +X direction.
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
DrawingHandler MyDrawingHandler = new DrawingHandler();
DwgObject exampleObject = new DwgObject(MyDrawingHandler.GetActiveDrawing().GetSheet().GetAllViews().Current as ViewBase,
new Point(100, 100), "filename");
Vector moveVector = new Vector(new Point(1000, 0) - new Point(0, 0));
exampleObject.MoveObjectRelative(moveVector);
}
}

Tekla.Structures.Drawing.EmbeddedObjectBase.Resize(Tekla.Structures.Drawing.Size)
Resizes the object. The scaling type is changed to ScaleToFit.
size: The width and height to be used.
Returns: True.
Tekla.Structures.Drawing.ScalingOptions

Tekla.Structures.Drawing.EmbeddedObjectBase.GetAxisAlignedBoundingBox
Gets the bounding box for the current object in the global axis coordinate system.
Returns: A rectangle bounding box for the current object.

Tekla.Structures.Drawing.EmbeddedObjectBase.GetObjectAlignedBoundingBox
Gets the bounding box for the current object in its local coordinate system.
Returns: A rectangle bounding box for the current object.